#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.web_apps.module.citizen_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.etl_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.key_valuts.azurerm_key_vault.com will be created
  + resource "azurerm_key_vault" "com" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-com-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "io-p-itn-com-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.web_apps.azurerm_monitor_autoscale_setting.push_notif_function[0] will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "push_notif_function" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-com-pushnotif-as-01"
        name                = "io-p-itn-com-pushnotif-as-01"
        tags                = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "IO_COM_PUSH_NOTIFICATIONS_REDIRECT_PERCENTAGE"                                                    = "1" -> "0"
            # (36 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.cqrs_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-cqrs-func-01] Health Check Failed"
        name                     = "io-p-itn-com-cqrs-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

Warning: Deprecated attribute

  on ../_modules/storage_accounts/storage_account_io_com.tf line 32, in resource "azurerm_storage_container_immutability_policy" "deleted_messages_logs":
  32:   storage_container_resource_manager_id = azurerm_storage_container.deleted_messages_logs.resource_manager_id

The attribute "resource_manager_id" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
